In [1]:
import pandas as pd

In [2]:
# another example is below 
person = {
    'first':['ram','sham','shubham'],
    'last':['patil','sharma','patne'],
    'age':[23,25,24],
    'email':['ram@gmail.com','sham@gmail.com','shubham@gmail.com']
}
# here columns are first , last and age and each index in list is a row
# for key,value in person.items():
#     print(key+': '+str(value))
person['age']

[23, 25, 24]

# Make DF from dict

In [3]:

df = pd.DataFrame(person)
df

     first    last  age              email
0      ram   patil   23      ram@gmail.com
1     sham  sharma   25     sham@gmail.com
2  shubham   patne   24  shubham@gmail.com

# we can access any columns now just like dict , but keep in mind DF is high level dict with addtional features
# like here each coloumn or key will be of type series not list

In [4]:
df['first']
# df.first

0        ram
1       sham
2    shubham
Name: first, dtype: object

# this is of type series. Series in layman term is rows of data 
# So , dataframe is set or rows and coloumn and series is rows of single coloumn
# Dataframe is container for multiple series objects

In [5]:
type(df['first'])

pandas.core.series.Series

# Asscessing muliple columns , it will not return series but new filtered DF

In [6]:
df[['first','last']]

     first    last
0      ram   patil
1     sham  sharma
2  shubham   patne

In [7]:
df.columns

Index(['first', 'last', 'age', 'email'], dtype='object')

# Asscssing rows

In [8]:
# iloc - index location
df.iloc[0] # gives first row

# multpile rows
df.iloc[[0,1]] # gives first and second row

  first    last  age           email
0   ram   patil   23   ram@gmail.com
1  sham  sharma   25  sham@gmail.com

In [9]:
# filterting out rows with particular columns
# first param will list of list of index and second param will be list of list of index column we want to display
df.iloc[[0,2],[2]]

   age
0   23
2   24

In [10]:
# loc will perform on lable
df.loc[[0,1],['first','age']]

  first  age
0   ram   23
1  sham   25

# Set , reset and use indexes

In [11]:
df

     first    last  age              email
0      ram   patil   23      ram@gmail.com
1     sham  sharma   25     sham@gmail.com
2  shubham   patne   24  shubham@gmail.com

In [12]:
# index is unique indientifier and that we can use as lable which will be easy to locate specfic rows instead 
# of simply putting rows
df.set_index('email',inplace=True)

In [13]:
df.loc['ram@gmail.com','first']

'ram'

In [14]:
df.reset_index(inplace=True)

# Filtering Data using conditions on rows and columns

In [15]:
filt_1 = (df['last'] == 'patne')
filt_2 = (df['age'] >=24)
filt_3 = filt_1 & filt_2
filt_4 = filt_1 | filt_2

# these will give series of bollean values
filt_4

0    False
1     True
2     True
dtype: bool

In [16]:
df[filt_4]

               email    first    last  age
1     sham@gmail.com     sham  sharma   25
2  shubham@gmail.com  shubham   patne   24

In [17]:
# This is more prefered as we can pass filter and also fetch a particular column
# like person first and last name whose age as greater than or equal to 24
df.loc[filt_2,['first','last']]

     first    last
1     sham  sharma
2  shubham   patne

In [18]:
# ~ will perform not equal opreation 
df.loc[~filt_2,['first','last']]

  first   last
0   ram  patil

# Alter Rows and Columns

In [19]:
df.columns
# Change each columns to upper or lower or change names
df.columns = ['email','first_name','last_name','age']

In [20]:
df.columns = [x.lower() for x in df.columns]

In [21]:
df.columns = df.columns.str.replace(' ','_')
df

               email first_name last_name  age
0      ram@gmail.com        ram     patil   23
1     sham@gmail.com       sham    sharma   25
2  shubham@gmail.com    shubham     patne   24

In [22]:
# Changing particular columns
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [23]:
# Chaning particular rows 
# to change all the values
df.loc[2] = ['shubham.patne@gmail.com','shubham','patil',26]

In [24]:
# Changing only requried rows
df.loc[2, ['last','age']] = ['patne',24]
df.loc[2]

email    shubham.patne@gmail.com
first                    shubham
last                       patne
age                           24
Name: 2, dtype: object

In [25]:
df.loc[1 , 'age'] = 23
# Use .loc only to assinge the row values

In [26]:
# Chananig all the values of particular column
df['email'] = df['email'].str.lower()

# 4 methods to change rows

In [27]:
# apply , map , applymap , replace

# apply is used for calling a function on values either DF or series objects. It works little different for DF and series.

# For example lets say we want length of each email so we will apply on email series object

df['email'].apply(len)

0    13
1    14
2    23
Name: email, dtype: int64

In [28]:
# we can also use this to update values , lets say we have replace 'gmail' with 'email' as address . Just for example

def change_email(email):
    return email.replace('gmail','email')

df['email'].apply(change_email) # This will not change until we assgine it

df['email'] = df['email'].apply(change_email)

In [29]:
# Running apply to DF will apply on each series objects , where as running apply to series will apply on each values
# Just note if we do apply on DF inputs will be series 

df.apply(pd.Series.min) # This gives min values for each columns going row wise
df.apply(len)

email    3
first    3
last     3
age      3
dtype: int64

In [30]:
# df.apply(pd.Series.min ,axis='columns') 
# this will give error as for our data it will not be able to compare string and int of column

In [31]:
# applymap will map the function to each indivual value of DF
df.applymap(lambda x: len(str(x)))

   email  first  last  age
0     13      3     5    2
1     14      4     6    2
2     23      7     5    2

In [32]:
# map & replace will work only on series
df['age'] = df['age'].replace({23:24,24:25})

In [33]:
# map we will give values for that column to change as dict if value not given it will update null 
df['first'].map({'ram':'harry','sham':'john'})

0    harry
1     john
2      NaN
Name: first, dtype: object

In [34]:
df['age'].apply(lambda x : x+1)
df.loc[2,'age'] = 23
df.loc[1,'age'] = 24

# Add/Remove Rows and Columns From DataFrames

In [36]:
# Adding new column named full_name
df['full_name'] = df['first'] + ' ' + df['last']

In [40]:
df['age_percent'] = df['age'].map(lambda x : x/100)

In [42]:
# Add two temp columns just to check how we can delete or drop particular column
df['temp1'] = df['age'] + 10
df['temp2'] = df['age'] + 20

In [45]:
# We have to drop method on DF to specify which columns to drop
df.drop(columns=['temp1','temp2'] , inplace=True)

In [49]:
# If we want to seperate existing column to multiple columns we can split and assign 
# We have to use expand = True to expand the list values

df.drop(columns=['first','last'],inplace=True)

In [53]:
df['full_name'].str.split(' ',expand=True)

         0       1
0      ram   patil
1     sham  sharma
2  shubham   patne

In [54]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [55]:
df

                     email  age      full_name  age_percent    first    last
0            ram@email.com   24      ram patil         0.24      ram   patil
1           sham@email.com   24    sham sharma         0.24     sham  sharma
2  shubham.patne@email.com   23  shubham patne         0.23  shubham   patne

In [59]:
# Adding single row in the DF
df = df.append({'first':'Tony','last':'Deo'},ignore_index=True)

In [68]:
# Add remainng values
df.loc[3,['email','age','full_name']] = ['Tony.Deo@email.com',26, 'Tony Deo']

In [76]:
# Appending a DF to exsting DF
person_2 = {
    'first':['Stev','Wanda'],
    'last':['Rogers','vison'],
    'age':[27,22],
    'email':['stev@avaenge.com','wanda@avarnge.com']
}

df2 = pd.DataFrame(person_2)

In [78]:
# Append this DF 
df = df.append(df2,ignore_index=True)

In [82]:
df['first'] = df['first'].map(lambda x : x.lower())

In [85]:
df

                     email   age      full_name  age_percent    first    last
0            ram@email.com  24.0      ram patil         0.24      ram   patil
1           sham@email.com  24.0    sham sharma         0.24     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne         0.23  shubham   patne
3       Tony.Deo@email.com  26.0       Tony Deo          NaN     tony     Deo
4         stev@avaenge.com  27.0            NaN          NaN     stev  Rogers
5        wanda@avarnge.com  22.0            NaN          NaN    wanda   vison

In [86]:
# Dropping / removing particular row
df.drop(index=3)

                     email   age      full_name  age_percent    first    last
0            ram@email.com  24.0      ram patil         0.24      ram   patil
1           sham@email.com  24.0    sham sharma         0.24     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne         0.23  shubham   patne
4         stev@avaenge.com  27.0            NaN          NaN     stev  Rogers
5        wanda@avarnge.com  22.0            NaN          NaN    wanda   vison

In [88]:
# removing rows where age_percent is null
filt = (df['age_percent'].isnull())

# .index method will give indices of those filtered rows . To make changes to DF use inplace = True
df.drop(index=df[filt].index)

                     email   age      full_name  age_percent    first    last
0            ram@email.com  24.0      ram patil         0.24      ram   patil
1           sham@email.com  24.0    sham sharma         0.24     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne         0.23  shubham   patne

# Sorting Data

In [90]:
# Drop uncessary columns 
df.drop(columns=['age_percent'],inplace=True)

In [93]:
# Sort by last name in desceding order
df.sort_values(by='last', ascending=False)

                     email   age      full_name    first    last
5        wanda@avarnge.com  22.0            NaN    wanda   vison
1           sham@email.com  24.0    sham sharma     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne  shubham   patne
0            ram@email.com  24.0      ram patil      ram   patil
4         stev@avaenge.com  27.0            NaN     stev  Rogers
3       Tony.Deo@email.com  26.0       Tony Deo     tony     Deo

In [95]:
# Sort by last name and if last name is same then sort by first name in desceding order
df.sort_values(by=['last','first'],ascending=False)

                     email   age      full_name    first    last
5        wanda@avarnge.com  22.0            NaN    wanda   vison
1           sham@email.com  24.0    sham sharma     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne  shubham   patne
0            ram@email.com  24.0      ram patil      ram   patil
4         stev@avaenge.com  27.0            NaN     stev  Rogers
3       Tony.Deo@email.com  26.0       Tony Deo     tony     Deo

In [97]:
# Sort by last name in descending order and first name in ascedning order
df.sort_values(by=['last','first'],ascending=[False,True])

                     email   age      full_name    first    last
5        wanda@avarnge.com  22.0            NaN    wanda   vison
1           sham@email.com  24.0    sham sharma     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne  shubham   patne
0            ram@email.com  24.0      ram patil      ram   patil
4         stev@avaenge.com  27.0            NaN     stev  Rogers
3       Tony.Deo@email.com  26.0       Tony Deo     tony     Deo

In [98]:
# Sort by index to make it as it was before
df.sort_index()

                     email   age      full_name    first    last
0            ram@email.com  24.0      ram patil      ram   patil
1           sham@email.com  24.0    sham sharma     sham  sharma
2  shubham.patne@email.com  23.0  shubham patne  shubham   patne
3       Tony.Deo@email.com  26.0       Tony Deo     tony     Deo
4         stev@avaenge.com  27.0            NaN     stev  Rogers
5        wanda@avarnge.com  22.0            NaN    wanda   vison

In [99]:
# sort particular columns
df['age'].sort_values()

5    22.0
2    23.0
0    24.0
1    24.0
3    26.0
4    27.0
Name: age, dtype: float64

# Cleaning Data

In [100]:
import numpy as np

In [111]:
people = {
    'first':['ram','sham','shubham','John',np.nan,None,'NA'],
    'last':['patil','sharma','patne','Doe',np.nan,'Potter','Missing'],
    'age':['23','25','27','44',None,None,'Missing'],
    'email':['ram@gmail.com','sham@gmail.com','shubham@gmail.com','john@gmail.com',None,np.nan,'Anoyamous@gmail.com']
}

In [127]:
df = pd.DataFrame(people)

# To replace custom NA or Missing values
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [113]:
df

     first     last      age                email
0      ram    patil       23        ram@gmail.com
1     sham   sharma       25       sham@gmail.com
2  shubham    patne       27    shubham@gmail.com
3     John      Doe       44       john@gmail.com
4      NaN      NaN     None                 None
5     None   Potter     None                  NaN
6       NA  Missing  Missing  Anoyamous@gmail.com

In [128]:
# To drop rows having None or nan values we can use dropna method
# default values they use are (axis='index'  , how='any')
# Axis if index it will drop rows and if columns it will drop columns
# how defines criteria like for 'any' it will drop row if any of columns have null and for 'all' it will 
# drop only if all columns of the rows are null

df.dropna()

     first    last age              email
0      ram   patil  23      ram@gmail.com
1     sham  sharma  25     sham@gmail.com
2  shubham   patne  27  shubham@gmail.com
3     John     Doe  44     john@gmail.com

In [129]:
df.dropna(axis='index',how='any')

     first    last age              email
0      ram   patil  23      ram@gmail.com
1     sham  sharma  25     sham@gmail.com
2  shubham   patne  27  shubham@gmail.com
3     John     Doe  44     john@gmail.com

In [130]:
df.dropna(axis='index',how='all') # Notice record having potter last name

     first    last   age                email
0      ram   patil    23        ram@gmail.com
1     sham  sharma    25       sham@gmail.com
2  shubham   patne    27    shubham@gmail.com
3     John     Doe    44       john@gmail.com
5     None  Potter  None                  NaN
6      NaN     NaN   NaN  Anoyamous@gmail.com

In [131]:
# This will drop whole DF as we have one row in which all the columns are None
df.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [132]:
# If we want to drop rows only if particular columns are null then we can pass subset list
# Notice here if we pass subset , then 'how' will look into those columns only
# For example here if we pass how='any' then it will drop rows if any of email or last name is null
# And if we pass how='all' then it will drop rows only if both of these all null

df.dropna(axis='index',how='any',subset=['email','last'])

     first    last age              email
0      ram   patil  23      ram@gmail.com
1     sham  sharma  25     sham@gmail.com
2  shubham   patne  27  shubham@gmail.com
3     John     Doe  44     john@gmail.com

In [136]:
# To fill NAN data
df.fillna('MISSING')
# df['age'].fillna('0')

     first     last      age                email
0      ram    patil       23        ram@gmail.com
1     sham   sharma       25       sham@gmail.com
2  shubham    patne       27    shubham@gmail.com
3     John      Doe       44       john@gmail.com
4  MISSING  MISSING  MISSING              MISSING
5  MISSING   Potter  MISSING              MISSING
6  MISSING  MISSING  MISSING  Anoyamous@gmail.com

# Typecasting

In [138]:
df.dtypes

first    object
last     object
age      object
email    object
dtype: object

In [139]:
# Age is string we have to convert them to int or float
# We have to convert them to float as np.nan is of type float
# So if we try to convert into int it will throw error
type(np.nan)

float

In [140]:
df['age'] = df['age'].astype(float)

In [142]:
df.dtypes

first     object
last      object
age      float64
email     object
dtype: object

In [144]:
df['age'].describe()

count     4.000000
mean     29.750000
std       9.639329
min      23.000000
25%      24.500000
50%      26.000000
75%      31.250000
max      44.000000
Name: age, dtype: float64